In [42]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

# Read School and Student Data File and store into Pandas DataFrames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

# Combine the data into a single dataset.  
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])
school_data_complete.head()
#student_data.head()
#school_data_complete.dtypes

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [26]:
school_data.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [88]:
num_stu = len(student_data)
pass_math = (sum(student_data["math_score"] >=70) / num_stu) * 100
pass_read = (sum(student_data["reading_score"] >=70) / num_stu) * 100
stu_pass = ((len(student_data.loc[(student_data['math_score']>=70) & (student_data['reading_score']>= 70)])) / num_stu) * 100

dist_sumry = [
    {"Total Schools":len(school_data), 
     "Total Students":num_stu, 
     "Total Budget":sum(school_data["budget"]), 
     "Average Math Score":student_data["math_score"].mean(),
     "Average Reading Score":student_data["reading_score"].mean(),
     "% Passing Math":pass_math, 
     "% Passing Reading":pass_read, 
     "% Overall Passing":stu_pass}]
dist_sumry_df = pd.DataFrame(dist_sumry)
#dist_sumry["Total Students"] = dist_sumry["Total Students"].map("{:,}".format)
#pd.options.display.float_format = "{:,0f}".format
#df.style.format('{:,}')
#dist_sumry_df = dist_sumry_df.style.format('{:,.6f}')
pd.options.display.float_format = "{:,.6f}".format
#len(student_data) # df.style.format('{:,.6}')
#stu_pass = ((len(student_data.loc[(student_data['math_score']>=70) & (student_data['reading_score']>= 70)])) / num_stu) * 100
#(stu_sumry / num_stu) * 100
#passing = sum(stu_su)
#stu_pass
dist_sumry_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,78.985371,81.877840,74.980853,85.805463,65.172326

In [90]:
#schl_sumry = [
#    {"School Name":0,
#    "School Type":0,
#    "Total Students":0,
#    "Total School Budget":0,
#    "Per Student Budget":0,
#    "Average Math Score":0,
#    "Average Reading Score":0,
#    "% Passing Math":0,
#    "% Passing Reading":0,
#    "% Overall Passing":0
#    }]

#schl_sumry = pd.DataFrame(schl_sumry) 
school_data.head()

             school_name      type  size   budget
0      Huang High School  District  2917  1910635
1   Figueroa High School  District  2949  1884411
2    Shelton High School   Charter  1761  1056600
3  Hernandez High School  District  4635  3022020
4    Griffin High School   Charter  1468   917500

In [91]:
#schl_sumry_df = school_data
schl_sumry_df = school_data.rename(columns={'school_name':'School Name','type':'School Type', 'size':'Total Students','budget':'Total School Budget'})
schl_sumry_df.head()

             School Name School Type  Total Students  Total School Budget
0      Huang High School    District            2917              1910635
1   Figueroa High School    District            2949              1884411
2    Shelton High School     Charter            1761              1056600
3  Hernandez High School    District            4635              3022020
4    Griffin High School     Charter            1468               917500

In [94]:
#del schl_sumry_df['School ID']
#schl_sumry["School Name"] = school_data['school_name'].values
#schl_sumry["School Type"] = school_data['type'].values
#schl_sumry["Total Students"] = school_data['size'].values
#schl_sumry["Total School Budget"] = school_data['budget'].values
budget_per = schl_sumry_df['Total School Budget'] / schl_sumry_df['Total Students']
budget_per

0    655.000000
1    639.000000
2    600.000000
3    652.000000
4    625.000000
5    578.000000
6    582.000000
7    628.000000
8    581.000000
9    609.000000
10   583.000000
11   637.000000
12   650.000000
13   644.000000
14   638.000000
dtype: float64

In [93]:
schl_sumry_df["Per Student Budget"] = budget_per
schl_sumry_df.head()

,School Name,School Type,Total Students,Total School Budget,Per Student Budget
0,Huang High School,District,2917,1910635,655.000000
1,Figueroa High School,District,2949,1884411,639.000000
2,Shelton High School,Charter,1761,1056600,600.000000
3,Hernandez High School,District,4635,3022020,652.000000
4,Griffin High School,Charter,1468,917500,625.000000

In [134]:
avg_math =  school_data_complete.groupby('school_name',as_index=False)['math_score'].mean()
schl_sumry_df['Average Math Score'] = avg_math['math_score']

avg_read = school_data_complete.groupby('school_name',as_index=False)['reading_score'].mean()
schl_sumry_df['Average Reading Score'] = avg_read['reading_score']  

# pass_math = (sum(student_data["math_score"] >=70) / num_stu) * 100
pct_math = school_data_complete.groupby('school_name',as_index=False)['math_score'].sum() #>= 70 #/ school_data_complete['size'] * 100
#pct_math = pct_math['math_score'] 
#schl_sumry_df['% Passing Math'] = avg_read['reading_score']
schl_sumry_df
#pct_math

,School Name,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score
0,Huang High School,District,2917,1910635,655.000000,77.048432,81.033963
1,Figueroa High School,District,2949,1884411,639.000000,83.061895,83.975780
2,Shelton High School,Charter,1761,1056600,600.000000,76.711767,81.158020
3,Hernandez High School,District,4635,3022020,652.000000,77.102592,80.746258
4,Griffin High School,Charter,1468,917500,625.000000,83.351499,83.816757
5,Wilson High School,Charter,2283,1319574,578.000000,77.289752,80.934412
6,Cabrera High School,Charter,1858,1081356,582.000000,83.803279,83.814988
7,Bailey High School,District,4976,3124928,628.000000,76.629414,81.182722
8,Holden High School,Charter,427,248087,581.000000,77.072464,80.966394
9,Pena High School,Charter,962,585858,609.000000,83.839917,84.044699
10,Wright High School,Charter,1800,1049400,583.000000,76.842711,80.744686
11,Rodriguez High School,District,3999,2547363,637.000000,83.359455,83.725724
12,Johnson High School,District,4761,3094650,650.000000,83.418349,83.848930
13,Ford High School,District,2739,1763916,644.000000,83.274201,83.989488
14,Thomas High School,Charter,1635,1043130,638.000000,83.682222,83.955000

In [158]:
pct_math_df = school_data_complete['math_score'].loc[(school_data_complete['math_score'] >= 70)]                               
pct_math_df
#pct_math_df['school_name','math_score']

0        79
4        84
5        94
6        80
8        87
         ..
39165    90
39166    70
39167    84
39168    90
39169    75
Name: math_score, Length: 29370, dtype: int64

              school_name  math_score
0      Bailey High School      383393
1     Cabrera High School      154329
2    Figueroa High School      226223
3        Ford High School      211184
4     Griffin High School      122360
5   Hernandez High School      358238
6      Holden High School       35784
7       Huang High School      223528
8     Johnson High School      366942
9        Pena High School       80654
10  Rodriguez High School      307294
11    Shelton High School      146796
12     Thomas High School      136389
13     Wilson High School      190115
14     Wright High School      150628

In [31]:

pct_math = 
schl_sumry["Per Student Budget"] = budget_per
schl_sumry["Average Math Score"] = avg_math
schl_sumry["Average Reading Score"] = avg_read
schl_sumry["% Passing Math"] = pct_math
schl_sumry["% Passing Reading"] = pct_read
schl_sumry["% Overall Passing"] = pct_overall

schl_sumry_df

              School Name School Type  Total Students  Total Budget
0       Huang High School    District            2917       1910635
1    Figueroa High School    District            2949       1884411
2     Shelton High School     Charter            1761       1056600
3   Hernandez High School    District            4635       3022020
4     Griffin High School     Charter            1468        917500
5      Wilson High School     Charter            2283       1319574
6     Cabrera High School     Charter            1858       1081356
7      Bailey High School    District            4976       3124928
8      Holden High School     Charter             427        248087
9        Pena High School     Charter             962        585858
10     Wright High School     Charter            1800       1049400
11  Rodriguez High School    District            3999       2547363
12    Johnson High School    District            4761       3094650
13       Ford High School    District            2739       1763916
14     Thomas High School     Charter            1635       1043130